FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СкладПоУмолчаниюПоПодразделению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СкладПоУмолчаниюПоПодразделению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СкладПоУмолчаниюПоПодразделению/Ext/ManagerModule.bsl
Функция ПолучитьСкладПоПодразделению(Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкладПоУмолчаниюПоПодразделению.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	РегистрСведений.СкладПоУмолчаниюПоПодразделению КАК СкладПоУмолчаниюПоПодразделению
		|ГДЕ
		|	СкладПоУмолчаниюПоПодразделению.Подразделение В ИЕРАРХИИ(&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СкладКомпании;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции
